app/Controllers/Dashboard.php

SELECT `deteksi`.*, `pengguna`.`nama_lengkap`
FROM `deteksi`
JOIN `pengguna` ON `pengguna`.`id` = `deteksi`.`id_pengguna_operator`
ORDER BY `deteksi`.`waktu` DESC
 LIMIT 10
---
    public function index()
    {
        $model = new DetectionModel();
        $data['title'] = 'Dashboard Real-time';
        $data['detections'] = $model->select('deteksi.*, pengguna.nama_lengkap')
                                    ->join('pengguna', 'pengguna.id = deteksi.id_pengguna_operator')
                                    ->orderBy('deteksi.waktu', 'DESC')
                                    ->limit(10)
                                    ->findAll();

SELECT `deteksi`.*, `pengguna`.`nama_lengkap`
FROM `deteksi`
JOIN `pengguna` ON `pengguna`.`id` = `deteksi`.`id_pengguna_operator`
WHERE DATE_FORMAT(deteksi.waktu, '%Y-%m') = '2025-07'
AND `deteksi`.`id_pengguna_operator` = '2'
ORDER BY `deteksi`.`waktu` DESC
---
    private function getFilteredData()
    {
        $detectionModel = new DetectionModel();
        $filterBulan = $this->request->getGet('bulan');
        $filterOperator = $this->request->getGet('operator');

        $query = $detectionModel->select('deteksi.*, pengguna.nama_lengkap')
                                ->join('pengguna', 'pengguna.id = deteksi.id_pengguna_operator');

        if ($filterBulan && $filterBulan !== 'semua') {
            $query->where("DATE_FORMAT(deteksi.waktu, '%Y-%m')", $filterBulan);
        }

        if ($filterOperator && $filterOperator !== 'semua') {
            $query->where('deteksi.id_pengguna_operator', $filterOperator);
        }

        return $query->orderBy('deteksi.waktu', 'DESC')->findAll();

SELECT `deteksi`.*, `pengguna`.`nama_lengkap`
FROM `deteksi`
JOIN `pengguna` ON `pengguna`.`id` = `deteksi`.`id_pengguna_operator`
ORDER BY `deteksi`.`waktu` DESC
 LIMIT 10
---
    public function getRealtimeData()
    {
        $model = new DetectionModel();
        $data = $model->select('deteksi.*, pengguna.nama_lengkap')
                      ->join('pengguna', 'pengguna.id = deteksi.id_pengguna_operator')
                      ->orderBy('deteksi.waktu', 'DESC')
                      ->limit(10)
                      ->findAll();