app/Controllers/Dashboard.php

    public function index()
    {
        if (session()->get('user_role') == 'admin') {
            return redirect()->to('/dashboard/full-report');
        }

        $prodModel = new ProductionModel();

        $activeProduction = $prodModel->select('produksi.*, varian_roti.nama_varian')
        ->join('varian_roti', 'varian_roti.id = produksi.id_varian_roti')
        ->where('status', 'Berjalan')->first();

        if ($activeProduction) {
            $data['title'] = 'Pemantauan Produksi';
            $data['production'] = $activeProduction;
            return view('dashboard_view', $data);
        } else {
            $varianRotiModel = new VarianRotiModel();
            $data['title'] = 'Mulai Produksi Baru';
            $data['varian_roti_list'] = $varianRotiModel->findAll();
---
SELECT `produksi`.*, `varian_roti`.`nama_varian`
FROM `produksi`
JOIN `varian_roti` ON `varian_roti`.`id` = `produksi`.`id_varian_roti`
WHERE `status` = 'Berjalan'
 LIMIT 1
SELECT *
FROM `varian_roti`

    public function finishProduction($id)
    {
        $prodModel = new ProductionModel();
        $prodModel->update($id, [
            'status' => 'Selesai',
            'waktu_selesai' => date('Y-m-d H:i:s')
        ]);

        $finishedProduction = $prodModel->select('produksi.*, pengguna.nama_lengkap, varian_roti.nama_varian')
        ->join('pengguna', 'pengguna.id = produksi.id_pengguna_operator')
        ->join('varian_roti', 'varian_roti.id = produksi.id_varian_roti')
        ->find($id);
---
SELECT `produksi`.*, `pengguna`.`nama_lengkap`, `varian_roti`.`nama_varian`
FROM `produksi`
JOIN `pengguna` ON `pengguna`.`id` = `produksi`.`id_pengguna_operator`
JOIN `varian_roti` ON `varian_roti`.`id` = `produksi`.`id_varian_roti`
WHERE `produksi`.`id` = '3'

    private function getFilteredData()
    {
        $prodModel = new ProductionModel();
        $filterBulan = $this->request->getGet('bulan');
        $filterOperator = $this->request->getGet('operator');

        $query = $prodModel->select('produksi.*, pengguna.nama_lengkap, varian_roti.nama_varian')
        ->join('pengguna', 'pengguna.id = produksi.id_pengguna_operator')
        ->join('varian_roti', 'varian_roti.id = produksi.id_varian_roti')
        ->where('produksi.status', 'Selesai');

        if ($filterBulan && $filterBulan !== 'semua') {
            $query->where("DATE_FORMAT(produksi.waktu_mulai, '%Y-%m')", $filterBulan);
        }

        if (session()->get('user_role') == 'operator') {
            $query->where('produksi.id_pengguna_operator', session()->get('user_id'));
        } else {
            if ($filterOperator && $filterOperator !== 'semua') {
                $query->where('produksi.id_pengguna_operator', $filterOperator);
            }
        }

        return $query->orderBy('produksi.waktu_mulai', 'DESC')->findAll();
---
SELECT `produksi`.*, `pengguna`.`nama_lengkap`, `varian_roti`.`nama_varian`
FROM `produksi`
JOIN `pengguna` ON `pengguna`.`id` = `produksi`.`id_pengguna_operator`
JOIN `varian_roti` ON `varian_roti`.`id` = `produksi`.`id_varian_roti`
WHERE `produksi`.`status` = 'Selesai'
AND DATE_FORMAT(produksi.waktu_mulai, '%Y-%m') = '2025-06'
AND `produksi`.`id_pengguna_operator` = '4'
ORDER BY `produksi`.`waktu_mulai` DESC